emacs-config.org
#+TITLE: Emacs配置文件
#+AUTHOR: mawen
#+DATE: 2023/04/07 20:43:53
#+STARTUP: overview

* early-init.el
:PROPERTIES:
:HEADER-ARGS: :tangle early-init.el
:END:
- 在Emacs刚启动，尚未加载主要配置文件时的配置。
#+BEGIN_SRC emacs-lisp
  ;;; early-init.el --- Emacs pre-initialization config -*- lexical-binding: t -*-
  ;;; Commentary:

  ;;; Code:

  ;; 设置垃圾回收参数
  (setq gc-cons-threshold most-positive-fixnum)
  ;;; (setq gc-cons-percentage 0.6)
  ;; 清空避免加载远程文件的时候分析文件
  (setq file-name-handler-alist nil)

  ;; 启动早期不加载`package.el'包管理器
  (setq package-enable-at-startup nil)
  ;; 不从包缓存中加载
  (setq package-quickstart nil)

  ;; 禁止展示菜单栏、工具栏和纵向滚动条
  (push '(menu-bar-lines . 0) default-frame-alist)
  (push '(tool-bar-lines . 0) default-frame-alist)
  (push '(vertical-scroll-bars) default-frame-alist)

  ;; 禁止自动缩放窗口先
  (setq frame-inhibit-implied-resize t)

  ;; 禁止菜单栏、工具栏、滚动条模式，禁止启动屏幕和文件对话框
  (menu-bar-mode -1)                      ; 关闭菜单栏
  (tool-bar-mode -1)                      ; 关闭工具栏
  (scroll-bar-mode -1)                    ; 关闭滚动条
  (setq inhibit-splash-screen t)
  (setq use-file-dialog nil)

  ;; 在这个阶段不编译
  (setq comp-deferred-compilation nil)

  ;; 启动时窗口全屏
  (add-to-list 'default-frame-alist '(fullscreen . maximized))

  (provide 'early-init)
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;;; early-init.el ends here
#+END_SRC

* init.el
:PROPERTIES:
:HEADER-ARGS: :tangle init.el
:END:
** init.el 文件头
#+BEGIN_SRC emacs-lisp
;;; init.el --- The main init entry for Emacs -*- lexical-binding: t -*-
;;; Commentary:

;;; Code:
#+END_SRC
** package 包管理配置
#+begin_src emacs-lisp
(require 'package)
(setq package-check-signature nil)
(setq package-archives
	  '(("gnu"          . "http://1.15.88.122/gnu/")
	    ("melpa"        . "http://1.15.88.122/melpa/")
        ("melpa-stable" . "http://1.15.88.122/stable-melpa/")
	    ("nongnu"       . "http://1.15.88.122/nongnu/")))
(package-initialize)
#+end_src
** 安装use-package插件
#+BEGIN_SRC emacs-lisp
;; 安装 use-package
(unless (package-installed-p 'use-package)
   (package-refresh-contents)
   (package-install 'use-package))

;; 配置 use-package
(eval-and-compile
  (setq use-package-always-ensure nil)
  (setq use-package-always-defer nil)
  (setq use-package-expand-minimally nil)
  (setq use-package-enable-imenu-support t)
  (if (daemonp)
      (setq use-package-always-demand t)))

(eval-when-compile
  (require 'use-package))

;; 安装 use-package 的集成模块
(use-package use-package-ensure-system-package
  :ensure t)
(use-package diminish
  :ensure t)
(use-package bind-key
  :ensure t)

;; 安装 benchmark-init, 优化Emacs启动速度
(require 'benchmark-init-modes)
(require 'benchmark-init)
(benchmark-init/activate)
;;; To disable collection of benchmark data after init is done.
(add-hook 'after-init-hook 'benchmark-init/deactivate)
#+END_SRC
** 加载各模块化配置
#+BEGIN_SRC emacs-lisp
;; 将lisp目录放在加载路径之前以提高启动速度
(let ((dir (locate-user-emacs-file "lisp")))
  (add-to-list 'load-path (file-name-as-directory dir)))

;; 抹掉插件启动的输出
(with-temp-message ""
  (require 'init-ui)
  (require 'init-ai)
  (require 'init-base)
  (require 'init-dev)
  (require 'init-eaf)
  (require 'init-edit)
  (require 'init-english)
  (require 'init-finance)
  (require 'init-lsp)
  (require 'init-org)
  (require 'init-python)
  (require 'init-research)
  (require 'init-tools)
  )
#+END_SRC
** init.el 文件尾
#+BEGIN_SRC emacs-lisp
(provide 'init)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; init.el ends here
#+END_SRC
* init-ui.el
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-ui.el :mkdirp yes
:END:
** init-ui.el 文件头
#+BEGIN_SRC emacs-lisp
;;; init-ui.el --- UI settings -*- lexical-binding: t -*-
;;; Commentary:

;;; Code:
#+END_SRC
** 主题配置
- 主要使用由懒猫开发的一系列插件
*** [[https://github.com/manateelazycat/lazycat-theme][lazycat-theme]]
#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path (expand-file-name "~/.emacs.d/site-lisp/lazycat-theme"))
(require 'lazycat-theme)
#+END_SRC
*** [[https://github.com/guidoschmidt/circadian.el/tree/main][circadian]] 根据 daytime 切换主题
#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path (expand-file-name "~/.emacs.d/site-lisp/circadian"))
(require 'circadian)
(setq calendar-latitude 40.0)
(setq calendar-longitude 116.3)
;; (setq circadian-themes '((:sunrise . lazycat-light)
;;                          (:sunset  . lazycat-dark)))
(setq circadian-themes '((:sunrise . operandi)
                         (:sunset  . vivendi)))
(circadian-setup)
#+END_SRC
*** [[https://github.com/manateelazycat/awesome-tray][awesome-tray]]
#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path (expand-file-name "~/.emacs.d/site-lisp/awesome-tray"))
(require 'awesome-tray)
(awesome-tray-mode 1)

(setq mode-line-format nil)
#+End_SRC
** 字体配置
- 参考链接[[https://emacs-china.org/t/emacs/22193][为emacs正确配置英文、中文、符号字体的正确方式？]]
#+BEGIN_SRC emacs-lisp
;; sudo mv * /usr/share/fonts/truetype
;; sudo fc-cache -f -v
;; fc-list | grep Kaiti
;; https://einverne.github.io/post/2015/10/install-fonts-under-linux.html

;; 默认字体和字号 @ https://fonts.google.com/specimen/Fira+Mono
(set-face-attribute 'default nil :font "Fira Mono" :height 135)
;; 中文默认字体 @ https://mrswolf.github.io/my-manjaro-log/
(set-fontset-font "fontset-default" 'han "Kaiti")
;; 汉字间距显示问题
(setq inhibit-compacting-font-caches t)
;; 数学符号默认字体，保证 Unicode 数学符号可以正确显示
(set-fontset-font "fontset-default" 'mathematical "Cambria Math")
;; 固定间距字体 @ https://www.jetbrains.com/lp/mono/
(set-face-attribute 'fixed-pitch nil :font "JetBrains Mono"  :height 135)
;; 可变间距字体
(set-face-attribute 'variable-pitch nil :font "Segoe Print" :height 135 :weight 'regular)
#+END_SRC
