lisp/init-ui.el
;;; init-ui.el --- UI settings -*- lexical-binding: t -*-
;;; Commentary:

;;; Code:

(add-to-list 'load-path (expand-file-name "~/.emacs.d/site-lisp/lazycat-theme"))
(require 'lazycat-theme)
(lazycat-theme-load-dark)

(add-to-list 'load-path (expand-file-name "~/.emacs.d/site-lisp/awesome-tray"))
(require 'awesome-tray)
(awesome-tray-mode 1)

;; sudo mv * /usr/share/fonts/truetype
;; sudo fc-cache -f -v
;; fc-list | grep Kaiti
;; https://einverne.github.io/post/2015/10/install-fonts-under-linux.html

;; 默认字体和字号 @ https://fonts.google.com/specimen/Fira+Mono
(set-face-attribute 'default nil :font "Fira Mono" :height 135)
;; 中文默认字体 @ https://mrswolf.github.io/my-manjaro-log/
(set-fontset-font "fontset-default" 'han "Kaiti")
;; 汉字间距显示问题
(setq inhibit-compacting-font-caches t)
;; 数学符号默认字体，保证 Unicode 数学符号可以正确显示
(set-fontset-font "fontset-default" 'mathematical "Cambria Math")
;; 固定间距字体 @ https://www.jetbrains.com/lp/mono/
(set-face-attribute 'fixed-pitch nil :font "JetBrains Mono"  :height 135)
;; 可变间距字体
(set-face-attribute 'variable-pitch nil :font "Segoe Print" :height 135 :weight 'regular)
