emacs-config.org
** crux系统增强
- [[https://github.com/bbatsov/crux][crux]] 提供一系列的增强，如移动增强、删除增强等。
#+BEGIN_SRC emacs-lisp
;; crux
(use-package crux
  :ensure t
  :bind (("C-a" . crux-move-beginning-of-line)
         ("C-x 4 t" . crux-transpose-windows)
         ("C-x K" . crux-kill-other-buffers)
         ("C-k" . crux-smart-kill-line)
         ("C-c r" . crux-rename-file-and-buffer)
         ("C-x DEL" . crux-kill-line-backwards))
  :config
  (crux-with-region-or-buffer indent-region)
  (crux-with-region-or-buffer untabify)
  (crux-with-region-or-point-to-eol kill-ring-save)
  (defalias 'rename-file-and-buffer #'crux-rename-file-and-buffer))
#+END_SRC
** blink-search
- [[https://github.com/manateelazycat/blink-search][blink-search]] 是懒猫打造的搜索框架
#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path "~/.emacs.d/site-lisp/blink-search/")
(require 'blink-search)
#+END_SRC
** ivy 增强
- 参考 [[https://zhuanlan.zhihu.com/p/441612281][专业 Emacs 入门（五）：插件篇——功能优化类]]
#+BEGIN_SRC emacs-lisp
(use-package counsel
  :ensure t)

(use-package ivy
  :ensure t
  :init
  (ivy-mode 1)
  (counsel-mode 1)
  :config
  (setq ivy-use-virtual-buffers t)
  (setq search-default-mode #'char-fold-to-regexp)
  (setq ivy-count-format "(%d/%d) ")
  :bind
  (
   ("C-s" . 'swiper)
   ("C-x b" . 'ivy-switch-buffer)
   ("C-c v" . 'ivy-push-view)
   ("C-c s" . 'ivy-switch-view)
   ("C-c V" . 'ivy-pop-view)
   ("C-x C-@" . 'counsel-mark-ring)
   ("C-x C-SPC" . 'counsel-mark-ring)
   :map minibuffer-local-map
   ("C-r" . counsel-minibuffer-history)))
#+END_SRC
** amx 记录命令历史
- 参考 [[https://zhuanlan.zhihu.com/p/441612281][专业 Emacs 入门（五）：插件篇——功能优化类]]
#+BEGIN_SRC emacs-lisp
(use-package amx
  :ensure t
  :init (amx-mode))
#+END_SRC
** good-scroll 平滑滚动
- 参考 [[https://zhuanlan.zhihu.com/p/441612281][专业 Emacs 入门（五）：插件篇——功能优化类]]
- 在现代图形界面操作系统中，光标在上下移动、翻页的时候 =Emacs= 会直接刷新界面，滚动时也是按行滚动，比较粗糙。
- =good-scroll= 提供了平滑滚动，并且支持变速滚动，更加顺手。
#+BEGIN_SRC emacs-lisp
(use-package good-scroll
  :ensure t
  :if window-system          ; 在图形化界面时才使用这个插件
  :init (good-scroll-mode))
#+END_SRC
** toggle-one-window 最大化窗口布局与恢复
- 来自懒猫的插件 [[https://github.com/manateelazycat/toggle-one-window][toggle-one-window]]
- 遇到需要阅读较长文字的场合，可使用 =toggle-one-window= 命令切换到最大化模式。
- 阅览完毕后再次调用 =toggle-one-window= 命令恢复窗口布局。
#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path "~/.emacs.d/site-lisp/toggle-one-window/")
(require 'toggle-one-window)
#+END_SRC
** ace-window 多窗口切换
#+BEGIN_SRC emacs-lisp
;; ace-window
(use-package ace-window
  :ensure t
  :bind (("C-x o" . 'ace-window)))
#+END_SRC
** init-base.el 文件尾
#+BEGIN_SRC emacs-lisp
(provide 'init-base)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; init-base.el ends here
#+END_SRC
* init-edit.el
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-edit.el :mkdirp yes
:END:
** init-edit.el 文件头
#+BEGIN_SRC emacs-lisp
;;; init-edit.el --- Editing settings -*- lexical-binding: t -*-
;;; Commentary:

;;; Code:
#+END_SRC
** Emacs备份设置
- 不使用Emacs的自动备份设置。
#+BEGIN_SRC emacs-lisp
(setq make-backup-files nil)                                  ; 不自动备份
(setq auto-save-default nil)                                  ; 不使用Emacs自带的自动保存
#+END_SRC
** 解除一些不常用的快捷键
- 将一些不常用的快捷键解除，防止误操作。
#+BEGIN_SRC emacs-lisp
;; 解除不常用的快捷键定义
(global-set-key (kbd "C-z") nil)
(global-set-key (kbd "s-q") nil)
(global-set-key (kbd "M-z") nil)
(global-set-key (kbd "M-m") nil)
(global-set-key (kbd "C-x C-z") nil)
(global-set-key [mouse-2] nil)
#+END_SRC
** init-edit.el 文件尾
#+BEGIN_SRC emacs-lisp
;; (message "init-base configuration: %.2fs"
;;          (float-time (time-subtract (current-time) my/init-base-start-time)))

(provide 'init-edit)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; init-edit.el ends here
#+END_SRC
* init-finance.el
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-finance.el :mkdirp yes
:END:
** init-finance.el 文件头
#+BEGIN_SRC emacs-lisp
;;; init-finance.el --- Editing settings -*- lexical-binding: t -*-
;;; Commentary:

;;; Code:
#+END_SRC
** beancount 复式簿记法
#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path "~/.emacs.d/site-lisp/beancount/")
(require 'beancount)
(add-to-list 'auto-mode-alist '("\\.bean\\'" . beancount-mode))
;; (add-hook 'beancount-mode-hook
;;   (lambda () (setq-local electric-indent-chars nil)))
(add-hook 'beancount-mode-hook #'outline-minor-mode)
(define-key beancount-mode-map (kbd "C-c C-n") #'outline-next-visible-heading)
(define-key beancount-mode-map (kbd "C-c C-p") #'outline-previous-visible-heading)
#+END_SRC
** init-finance.el 文件尾
#+BEGIN_SRC emacs-lisp
;; (message "init-finance configuration: %.2fs"
;;          (float-time (time-subtract (current-time) my/init-base-start-time)))

(provide 'init-finance)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; init-edit.el ends here
#+END_SRC
* init-org.el
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-org.el :mkdirp yes
:END:
** init-org.el 文件头
#+BEGIN_SRC emacs-lisp
;;; init-org.el --- Org mode settings -*- lexical-binding: t -*-
;;; Commentary:

;;; Code:
#+END_SRC
** org-mode 配置
