emacs-config.org
** markdown-mode
#+BEGIN_SRC emacs-lisp
(use-package markdown-mode
  :ensure t
  :mode ("README\\.md\\'" . gfm-mode)
  :init (setq markdown-command "multimarkdown")
  :bind (:map markdown-mode-map
              ("C-c C-e" . markdown-do)))
#+END_SRC
** yasnippet
- 提供补全模板，参考 [[http://joaotavora.github.io/yasnippet/][yasnippet manual]]
#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path "~/.emacs.d/yasnippet")
(require 'yasnippet)
(yas-global-mode 1)
#+END_SRC
** lsp-bridge
- [[https://github.com/manateelazycat/lsp-bridge][lsp-bridge]] 插件旨在实现Emacs生态中最快的LSP客户端
#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path "~/.emacs.d/site-lisp/lsp-bridge/")
(require 'lsp-bridge)
(global-lsp-bridge-mode)

;; 开启 org-mode 补全
(setq lsp-bridge-enable-org-babe t)
#+END_SRC
** emacs-popon
- [[https://codeberg.org/akib/emacs-popon][emacs-popon]] 是 [[https://github.com/twlz0ne/acm-terminal][acm-terminal]] 的依赖 
#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path "~/.emacs.d/lisp/")
(require 'popon)
#+END_SRC
** acm-terminal
#+BEGIN_SRC emacs-lisp
(unless (package-installed-p 'yasnippet)
  (package-install 'yasnippet))

(unless (display-graphic-p)
  (add-to-list 'load-path "~/.emacs.d/lisp/"))
#+END_SRC
** init-lsp.el 文件尾
#+BEGIN_SRC emacs-lisp
(provide 'init-lsp)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; init-lsp.el ends here
#+END_SRC
* init-tools.el
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-tools.el :mkdirp yes
:END:
** init-tools.el 文件头
#+BEGIN_SRC emacs-lisp
;;; init-tools.el --- Tools settings -*- lexical-binding: t -*-
;;; Commentary: Useful tools to make Emacs efficient!

;;; Code:
#+END_SRC
** exec-path-from-shell
- purcell 开发的 [[https://github.com/purcell/exec-path-from-shell][exec-path-from-shell]] 让Emacs使用用户shell所设定的$PATH
#+BEGIN_SRC emacs-lisp
(use-package exec-path-from-shell
  :load-path "~/.emacs.d/site-lisp/exec-path-from-shell/"
  :config
  (when (memq window-system '(mac ns x))
    (exec-path-from-shell-initialize)))
#+END_SRC
** restart-emacs 重启
#+BEGIN_SRC emacs-lisp
(use-package restart-emacs
  :load-path "~/.emacs.d/site-lisp/restart-emacs/")
#+END_SRC
** which-key 快捷键提示
#+BEGIN_SRC emacs-lisp
(use-package which-key
  :load-path "~/.emacs.d/site-lisp/which-key/"
  :config
  (which-key-mode 1))
#+END_SRC
** init-tools.el 文件尾
#+BEGIN_SRC emacs-lisp
(provide 'init-tools)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; init-tools.el ends here
#+END_SRC
* init-dev.el
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-dev.el :mkdirp yes
:END:
** init-dev.el 文件头
#+BEGIN_SRC emacs-lisp
;;; init-dev.el --- Development settings -*- lexical-binding: t -*-
;;; Commentary:

;;; Code:
#+END_SRC
** projectile 项目管理
+ 参考 [[https://zhuanlan.zhihu.com/p/467681146][专业 Emacs 入门（七）：插件篇——编程开发类]]
#+BEGIN_SRC emacs-lisp
(use-package projectile
  :ensure t
  :bind (("C-c p" . projectile-command-map))
  :config
  (setq projectile-mode-line "Projectile")
  (setq projectile-track-known-projects-automatically nil))

(use-package counsel-projectile
  :ensure t
  :after (projectile)
  :init (counsel-projectile-mode))
#+END_SRC
** treemacs 工作区管理
#+BEGIN_SRC emacs-lisp
;; all-the-icons
;; @source https://github.com/domtronn/all-the-icons.el#installation
;; On Windows, after downloading the fonts, one needs to manually install them
;; M-x package-install RET all-the-icons
;; restart-emacs, M-x all-the-icons-install-fonts
(use-package all-the-icons
  :if (display-graphic-p))

;; depend on all-the-icons
(use-package treemacs
  :ensure t
  :defer t
  :config
  (treemacs-tag-follow-mode)
  :bind
  (:map global-map
        ("M-0"       . treemacs-select-window)
        ("C-x t 1"   . treemacs-delete-other-windows)
        ("C-x t t"   . treemacs)
        ("C-x t B"   . treemacs-bookmark)
        ;; ("C-x t C-t" . treemacs-find-file)
        ("C-x t M-t" . treemacs-find-tag))
  (:map treemacs-mode-map
	("/" . treemacs-advanced-helpful-hydra)))

(use-package treemacs-projectile
  :ensure t
  :after (treemacs projectile))

(use-package lsp-treemacs
  :ensure t
  :after (treemacs lsp))
#+END_SRC
** magit 版本管理
- 在 Emacs 里进行基于 magit 的版本控制
#+BEGIN_SRC emacs-lisp
;; magit
;; DEPENDENCY @ https://github.com/dandavison/delta
;; INSTALL delta @ https://dandavison.github.io/delta/installation.html
;; EDIT ~/.gitconfig @ https://dandavison.github.io/delta/get-started.html
(use-package magit
  :ensure t
  :hook (git-commit-mode . flyspell-mode)
  :bind (("C-x g"   . magit-status)
         ("C-x M-g" . magit-dispatch)
         ("C-c M-g" . magit-file-dispatch))
  :custom
  (magit-diff-refine-hunk t)
  (magit-ediff-dwim-show-on-hunks t))
#+END_SRC
** diff-hl 高亮显示修改部分
+ [[https://github.com/dgutov/diff-hl][diff-hl]] 插件在左侧高亮显示相对于远程仓库的修改部分
#+BEGIN_SRC emacs-lisp
;; diff-hl
(use-package diff-hl
  :ensure t
  :hook ((dired-mode         . diff-hl-dired-mode-unless-remote)
         (magit-pre-refresh  . diff-hl-magit-pre-refresh)
         (magit-post-refresh . diff-hl-magit-post-refresh))
  :init
  (global-diff-hl-mode t)
  :config
  ;; When Emacs runs in terminal, show the indicators in margin instead.
  (unless (display-graphic-p)
    (diff-hl-margin-mode)))
#+END_SRC
** magit-delta 增强 git diff
#+BEGIN_SRC emacs-lisp
(use-package magit-delta
  :ensure t
  :hook (magit-mode . magit-delta-mode)
  :config
  (setq magit-delta-hide-plus-minus-markers nil)
  )
#+END_SRC
** paren 高亮匹配括号
#+BEGIN_SRC emacs-lisp
(use-package paren
  :ensure nil
  :hook (after-init . show-paren-mode)
  :custom
  (show-paren-when-point-inside-paren t)
  (show-paren-when-point-in-periphery t))
#+END_SRC
** rainbow-delimeters 多彩括号
+ [[https://github.com/Fanael/rainbow-delimiters][rainbow-delimiters]] 插件多彩显示括号等分隔符
#+BEGIN_SRC emacs-lisp
(use-package rainbow-delimiters
  :ensure t
  :hook (prog-mode . rainbow-delimiters-mode))
#+END_SRC
** emacs-lisp 语言设置
#+BEGIN_SRC emacs-lisp
(use-package elisp-mode
  :ensure nil
  :after org
  :bind (:map emacs-lisp-mode-map
              ("C-c C-b" . eval-buffer)
              ("C-c C-c" . eval-to-comment)
              :map lisp-interaction-mode-map
              ("C-c C-c" . eval-to-comment)
              :map org-mode-map
              ("C-c C-;" . eval-to-comment)
              )
  :init
  ;; for emacs-lisp org babel
  (add-to-list 'org-babel-default-header-args:emacs-lisp
             '(:results . "value pp"))
  :config
  (defconst eval-as-comment-prefix " ⇒ ")
  (defun eval-to-comment (&optional arg)
    (interactive "P")
    ;; (if (not (looking-back ";\\s*"))
    ;;     (call-interactively 'comment-dwim))
    (call-interactively 'comment-dwim)
    (progn
      (search-backward ";")
      (forward-char 1))
    (delete-region (point) (line-end-position))
    (save-excursion
      (let ((current-prefix-arg '(4)))
        (call-interactively 'eval-last-sexp)))
    (insert eval-as-comment-prefix)
    (end-of-line 1))
  )
#+END_SRC
** smart-align.el 代码自动对齐插件
#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path "~/.emacs.d/site-lisp/smart-align/")
(require 'smart-align)
#+END_SRC
** effortless-indent 快速缩进粘贴的代码
#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path "~/.emacs.d/site-lisp/effortless-indent/")
(require 'effortless-indent)
#+END_SRC
** awesome-pair 括号自动补全插件
#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path "~/.emacs.d/site-lisp/awesome-pair/")
(require 'awesome-pair)

(dolist (hook (list
               'c-mode-common-hook
               'c-mode-hook
               'c++-mode-hook
               'java-mode-hook
               'haskell-mode-hook
               'emacs-lisp-mode-hook
               'lisp-interaction-mode-hook
               'lisp-mode-hook
               'maxima-mode-hook
               'ielm-mode-hook
               'sh-mode-hook
               'makefile-gmake-mode-hook
               'php-mode-hook
               'python-mode-hook
               'js-mode-hook
               'go-mode-hook
               'qml-mode-hook
               'jade-mode-hook
               'css-mode-hook
               'ruby-mode-hook
               'coffee-mode-hook
               'rust-mode-hook
               'qmake-mode-hook
               'lua-mode-hook
               'swift-mode-hook
               'minibuffer-inactive-mode-hook
               ))
  (add-hook hook '(lambda () (awesome-pair-mode 1))))

(define-key awesome-pair-mode-map (kbd "(") 'awesome-pair-open-round)
(define-key awesome-pair-mode-map (kbd "[") 'awesome-pair-open-bracket)
(define-key awesome-pair-mode-map (kbd "{") 'awesome-pair-open-curly)
(define-key awesome-pair-mode-map (kbd ")") 'awesome-pair-close-round)
(define-key awesome-pair-mode-map (kbd "]") 'awesome-pair-close-bracket)
(define-key awesome-pair-mode-map (kbd "}") 'awesome-pair-close-curly)
(define-key awesome-pair-mode-map (kbd "%") 'awesome-pair-match-paren)
(define-key awesome-pair-mode-map (kbd "\"") 'awesome-pair-double-quote)
(define-key awesome-pair-mode-map (kbd "M-o") 'awesome-pair-backward-delete)
(define-key awesome-pair-mode-map (kbd "C-k") 'awesome-pair-kill)
(define-key awesome-pair-mode-map (kbd "M-\"") 'awesome-pair-wrap-double-quote)
(define-key awesome-pair-mode-map (kbd "M-[") 'awesome-pair-wrap-bracket)
(define-key awesome-pair-mode-map (kbd "M-{") 'awesome-pair-wrap-curly)
(define-key awesome-pair-mode-map (kbd "M-(") 'awesome-pair-wrap-round)
(define-key awesome-pair-mode-map (kbd "M-)") 'awesome-pair-unwrap)
(define-key awesome-pair-mode-map (kbd "M-p") 'awesome-pair-jump-right)
(define-key awesome-pair-mode-map (kbd "M-n") 'awesome-pair-jump-left)
(define-key awesome-pair-mode-map (kbd "M-:") 'awesome-pair-jump-out-pair-and-newline)
#+END_SRC
** color-rg 基于ripgrep的搜索和重构工具
#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path "~/.emacs.d/site-lisp/color-rg/")
(require 'color-rg)
#+END_SRC
** init-dev.el 文件尾
#+BEGIN_SRC emacs-lisp
(provide 'init-dev)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; init-dev.el ends here
#+END_SRC
* init-python.el
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-python.el :mkdirp yes
:END:
** init-python.el 文件头
#+BEGIN_SRC emacs-lisp
;;; init-python.el --- Development settings -*- lexical-binding: t -*-
;;; Commentary:

;;; Code:
#+END_SRC
** REPL
#+BEGIN_SRC emacs-lisp
(use-package python
  :defer t
  :mode ("\\.py\\'" . python-mode)
  :interpreter ("python3" . python-mode))
#+END_SRC
** LSP Language Server
- 安装依赖
  - =pip3 install epc orjson sexpdata six paramiko=
  - =sudo pacman -S pyright ruff-lsp=
#+BEGIN_SRC emacs-lisp
(setq lsp-bridge-python-lsp-server "pyright")
;; specify environment to run epc
(setq lsp-bridge-python-command "/usr/bin/python")
#+END_SRC
** 虚拟环境
- 参考 [[https://github.com/manateelazycat/lsp-bridge/wiki/Python-virtualenv][lsp-bridge/wiki/Python-virtualenv]]
*** pyvenv
#+BEGIN_SRC emacs-lisp
(use-package pyvenv
  :ensure t
  :defer t
  :config
  (setenv "WORKON_HOME" (expand-file-name "~/.conda/envs"))
  (pyvenv-mode t)
  (add-hook 'python-mode-hook
            (lambda () (pyvenv-workon "dev")))
)
#+END_SRC
