lisp/init-python.el
;;; init-python.el --- Development settings -*- lexical-binding: t -*-
;;; Commentary:

;;; Code:

(use-package python
  :defer t
  :mode ("\\.py\\'" . python-mode)
  :interpreter ("python3" . python-mode))

(setq lsp-bridge-python-lsp-server "pyright")
;; specify environment to run epc
(setq lsp-bridge-python-command "/usr/bin/python")

(use-package pyvenv
  :ensure t
  :defer t
  :config
  (setenv "WORKON_HOME" (expand-file-name "~/.conda/envs"))
  (pyvenv-mode t)
  (add-hook 'python-mode-hook
            (lambda () (pyvenv-workon "dev")))
)
