emacs-config.org
** org-present
#+BEGIN_SRC emacs-lisp
(use-package org-present
  :defer t
  :config
  (defun my/org-present-prepare-slide (buffer-name heading)
    (org-overview)  ;; 仅显示顶层标题Show only top-level headlines
    (org-show-entry);; 展开当前标题Unfold the current entry
    (org-show-children))   ;; 显示当前子标题

  (defun my/org-present-start () ;; 开始幻灯片的设置
    (setq visual-fill-column-width 110
      visual-fill-column-center-text t) ;; 调整显示界面
    ;; 调整字体大小
    (setq-local face-remapping-alist '((default (:height 1.5) variable-pitch)
                                       (header-line (:height 4.0) variable-pitch)
                                       (org-document-title (:height 1.75) org-document-title)
                                       (org-code (:height 1.55) org-code)
                                       (org-verbatim (:height 1.55) org-verbatim)
                                       (org-block (:height 1.25) org-block)
                                       (org-block-begin-line (:height 0.7) org-block)))
    (setq header-line-format " ") ;; 在标题前加入空行
    (org-display-inline-images) ;; 显示图片
    (flyspell-mode 0) ;; 禁用拼写检查 (防止标红影响效果)
    (read-only-mode 1) ;; 只读模式
    )

  (defun my/org-present-end () ;; 重置上述设置
    (setq-local face-remapping-alist 
                '((default variable-pitch default)))      
    (setq header-line-format nil) 
    (org-remove-inline-images)
    (org-present-small)
    (flyspell-mode t)
    (read-only-mode 0))
  
  (add-hook 'org-present-mode-hook 'my/org-present-start)
  (add-hook 'org-present-mode-quit-hook 'my/org-present-end)
  (add-hook 'org-present-after-navigate-functions 'my/org-present-prepare-slide))
#+END_SRC
** init-research.el 文件尾
#+BEGIN_SRC emacs-lisp
(provide 'init-research)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; init-research.el ends here
#+END_SRC
* init-english.el
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-english.el :mkdirp yes
:END:
** init-english.el 文件头
#+BEGIN_SRC emacs-lisp
;;; init-english.el --- English Tools settings -*- lexical-binding: t -*-
;;; Commentary:

;;; Code:
#+END_SRC
** sdcv 查单词
- =sudo pacman -S stardict sdcv=
#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path "~/.emacs.d/site-lisp/sdcv/")
(require 'sdcv)

(use-package sdcv
  :commands (sdcv-search-pointer+)
  :bind
  (("\e\e w ," . sdcv-search-pointer+)
   ("\e\e w ." . sdcv-search-pointer))
  :config
  (setq sdcv-say-word-p t)
  (setq sdcv-dictionary-data-dir (expand-file-name "~/.emacs.d/site-lisp/sdcv"))
  (setq sdcv-dictionary-simple-list
      '(
        "懒虫简明英汉词典"
        "懒虫简明汉英词典"
        ))
  (setq sdcv-dictionary-complete-list
      '(
        "朗道英汉字典5.0"
        "牛津英汉双解美化版"
        ))
  (setq sdcv-tooltip-timeout 10)
  (setq sdcv-fail-notify-string "没找到释义")
  (setq sdcv-tooltip-border-width 2)
  )
#+END_SRC
** init-english.el 文件尾
#+BEGIN_SRC emacs-lisp
(provide 'init-english)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; init-english.el ends here
#+END_SRC
* init-eaf.el
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-eaf.el :mkdirp yes
:END:
** init-eaf.el 文件头
#+BEGIN_SRC emacs-lisp
;;; init-eaf.el --- emacs-application-framework settings -*- lexical-binding: t -*-
;;; Commentary:

;;; Code:
#+END_SRC
** emacs-application-framework
#+BEGIN_SRC emacs-lisp
  (add-to-list 'load-path "~/.emacs.d/site-lisp/emacs-application-framework/")
  (require 'eaf)

  ;;; eaf general settings
  (setq eaf-python-command "/usr/bin/python")

  ;;; eaf-browser
  (require 'eaf-browser)
  (setq eaf-browser-continue-where-left-off t)
  (setq eaf-browser-enable-adblocker t)
  (setq browse-url-browser-function 'eaf-open-browser)

  ;;; eaf-rss-reader
  ;; 一些优质RSS订阅源
  ;; https://manateelazycat.github.io/feed.xml           manateeLazyCat
  ;; https://superliooon.com/feed/                       即凉
  ;; http://blindwith.science/index.xml                  Blind with Science
  ;; https://remacs.cc/index.xml                         remacs的世界
  ;; https://www.bmpi.dev/index.xml                      BMPI
  ;; http://www.ruanyifeng.com/blog/atom.xml             Ruan YiFeng
  ;; https://emacstalk.codeberg.page/podcast/index.xml   EmacsTalk
  ;; https://arxiv.org/rss/cs.CV                         ArXiv CV
  ;; https://sachachua.com/blog/feed/                    Sacha Chua
  ;; https://byvoid.com/zhs/feed.xml                     byvoid
  ;; https://www.skyue.com/feed                          skyue
  ;; https://einverne.github.io/feed.xml                 Verne
  ;; https://liujiacai.net/atom.xml                      刘家财
  ;; https://planet.emacslife.com/                       Alvaro Ramirez
  ;; https://leovan.me/index.xml                         范叶亮
  ;; https://evex.one/index.xml                          EXEC
  (require 'eaf-rss-reader)

  ;;; eaf-pdf-viewer
  (require 'eaf-pdf-viewer)
  ;; 配置 eaf-interleave, 配合使用 eaf-pdf-viewer 和 org-mode
  ;; https://github.com/emacs-eaf/emacs-application-framework/blob/master/extension/eaf-interleave.el
  (require 'eaf-interleave)
  (add-hook 'eaf-browser-hook 'eaf-interleave-app-mode)
  (add-hook 'eaf-pdf-viewer-hook 'eaf-interleave-app-mode)
  (add-hook 'org-mode-hook 'eaf-interleave-mode)
  (with-eval-after-load 'eaf-interleave
    (define-key eaf-interleave-mode-map (kbd "M-.") 'eaf-interleave-sync-current-note)
    (define-key eaf-interleave-mode-map (kbd "M-p") 'eaf-interleave-sync-previous-note)
    (define-key eaf-interleave-mode-map (kbd "M-n") 'eaf-interleave-sync-next-note)
    (define-key eaf-interleave-app-mode-map (kbd "C-c M-o") 'eaf-interleave-open-notes-file)
    (define-key eaf-interleave-app-mode-map (kbd "C-c M-i") 'eaf-interleave-add-note)    
    (define-key eaf-interleave-app-mode-map (kbd "C-c M-q") 'eaf-interleave-quit))
  ;; 默认笔记路径, 自动在该目录中寻找同名 org 文件
  (setq eaf-interleave-org-notes-dir-list '("~/org/roam/interleave"))
  ;; 分隔文档和笔记
  (setq eaf-interleave-split-direction 'vertical
	eaf-interleave-split-lines 20
	eaf-interleave-disable-narrowing t)

  ;;; eaf-image-viewer
  (require 'eaf-image-viewer)

  ;;; eaf-js-video-player
  (require 'eaf-js-video-player)

  ;;; eaf-music-player
  (require 'eaf-music-player)
  (setq eaf-music-default-file "~/MEGA/Music/songs")

  ;;; eaf-pyqterminal
  (require 'eaf-pyqterminal)
  (setq eaf-pyqterminal-font-family "JetBrainsMono Nerd Font")

  ;;; eaf-file-manager
  (require 'eaf-file-manager)

  ;;; eaf-markdown-previewer
  (require 'eaf-markdown-previewer)

  ;;; eaf-org-previewer
  (require 'eaf-org-previewer)
#+END_SRC
** init-eaf.el 文件尾
#+BEGIN_SRC emacs-lisp
(provide 'init-eaf)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; init-eaf.el ends here
#+END_SRC
* init-ai.el
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-ai.el :mkdirp yes
:END:
** init-ai.el 文件头
#+BEGIN_SRC emacs-lisp
;;; init-ai.el --- AI Tools settings -*- lexical-binding: t -*-
;;; Commentary:

;;; Code:
#+END_SRC
** mind-wave
- [[https://github.com/manateelazycat/mind-wave][mind-wave]] 是 manateeLazyCat 基于ChatGPT API开发的AI插件
*** 安装
- 将 =API Key= 保存到 =~/.emacs.d/mind-wave/chatgpt_api_key.txt=
- 安装 =Python= 依赖 =pip install openai epc sexpdata six=
#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path "~/.emacs.d/site-lisp/mind-wave/")
(require 'mind-wave)
(setq mind-wave-auto-change-title nil) ; 避免与auto-save插件的冲突
#+END_SRC
*** 代理
- 安装 [[https://github.com/zzzgydi/clash-verge][Clash Verge]] 客户端 =sudo pacman -S clash-verge=
- 配置 clash-verge
  - 导入机场 URL
  - 设置端口号为 1080，让 proxy-ns 可以对接机场
- 配置 SwitchyOmega
  - 代理协议 Socks5
  - 代理服务器 127.0.0.1
  - 代理端口 1080
- 配置 proxy-ns 命令行代理
  - =yay -S proxy-ns=
  - =sudo systemctl enable --now proxy-nsd@main.service=
  - 在 =/etc/proxy-nsd/main.conf= 文件中找到 =ENABLE_IPV6= 选项，设置为 =ENABLE_IPV6=0=
- 更改特定应用的启动网络配置
  - 以 Emacs 为例，找到 =/usr/share/applications/emacs.desktop= 中的 =Exec= 字段，在字段开头加上 =proxy-ns=
  - 此时 Emacs 从启动器启动后就会自动应用代理网络，包括 Emacs 所启动的子进程
*** 功能
**** 对话模式
**** 多行输入
**** 文档模式
**** 代码模式
**** 摘要模式
**** 模型选择
** org-ai
- 编辑 =~/.authinfo.gpg= 文件，加入自己的 API KEY，格式为： =machine api.openai.com login org-ai password sk-yourkey=
#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path "~/.emacs.d/site-lisp/org-ai/")
(require 'org-ai)
(add-hook 'org-mode-hook #'org-ai-mode)
(org-ai-global-mode)
(setq org-ai-default-chat-system-prompt "你是一个 Emacs 助手，请以 Org-mode 的格式来回复我")
#+END_SRC
** init-ai.el 文件尾
#+BEGIN_SRC emacs-lisp
(provide 'init-ai)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; init-ai.el ends here
#+END_SRC

